#----------------------------------------------
# 연산자
#----------------------------------------------
# [3] 논리연산자
# 종류 : and,or,not
# 특징 : 여러개의 경우에 대한 결과를 바탕으로 결론을 내린다.
# - and : 결과1 and 결과2 and 결과3
#         결과 1,2,3  True 경우만 True
#----------------------------------------------
num1=8
num2=3
num1>0 and num2>0
print(f'{num1}>0 and {num2}>0 : {num1>0 and num2>0}')
print(f'{num1}>0 and {num2}==0 : {num1>0 and num2==0}')
print("--------------------------------------------------")
# or : 결과1 or 결과2 or 결과3
#      결과 1,2,3중에 한개 이상만 True 일때 True
print(f'{num1}>0 or {num2}>0 : {num1>0 or num2>0}')
print(f'{num1}>0 or {num2}==0 : {num1>0 or num2==0}')
print("--------------------------------------------------")
# not : not 결과
#       결과에 반대로 값을 출력
#       Ture ==> Flase ==> True로 값을 출력
print(f'not {num1}>0  : {not num1>0}')
print(f'not {num1}==0  : {not num1==0}')
