#----------------------------------------------------------------------
# 내장함수 map({함수이름_int, float, str}, {data_input().split()})
#----------------------------------------------------------------------
data=input("숫자데이터 입력 : ")
print(type(data), data)

# 1개 문자열 ===> 여러개 문자열 분리
# 예) '10,20,30' ===> '10', '20', '30'
nums=data.split()

result=map(int, nums)
print(type(result), result)             

#한번에 여러개 입력받기
a,b= map(int, input("입력1 : ").split())
print(a, b)
a,b= map(float, input("입력2: ").split())
print(a, b)
a,b= map(str, input("입력3 : ").split())
print(a, b)

#---------------------------------------------------------------------------------------------------
# 형변환 => 자동형변환/수동형변환
# 자동형변환 : 컴퓨터가 진행, 작은 ==> 큰것으로 바꿀 때 ex) 나눗셈할때 결과값이 실수로 출력되는것.
# 수동형변환 : 개발자 진행, 큰 것 ==> 작은 것으로 바꿀 때 ex) 결과값을 int()를 사용해 정수로 바꾸는 것.
#---------------------------------------------------------------------------------------------------
a = 10
b = 3
print(a/b)


