#-------------------------------------------------
# Dict 자료형 살펴보기
# 여러가지 데이터를 dict 타입으로 저장
#-------------------------------------------------
# [다양한 종류의 Key] -----------------------------
## - 키가 여러개 정보 합쳐서 사용하는 경우
## - 예) 홍길동,1997, 홍길동,2000 같은 이름을 사용해야 하는 경우 tuple(로 묶어주기)
person={"age":20, ('홍길동', 2000):100}
print(person)

#3명의 정보를 저장
p1={ 'name':'홍길동', 'age':20, 'job':'학생'}
p2={ 'name':'홍마징', 'age':30, 'job':'아빠'}
p3={ 'name':'홍길령', 'age':35, 'job':'엄마'}
p4={ 'name':'홍미련', 'age':15, 'job':'중학생'}
persons=[p1,p2,p3,p4]
print(persons[0]['name'])

# 4명을 딕셔너리로 담기
# key로 'age' 사용 
persons2={20:{ 'name':'홍길동','job':'학생'},
          30:{ 'name':'홍마징','job':'아빠'},
          35:{ 'name':'홍길령','job':'엄마'},
          15:{ 'name':'홍미련','job':'중학생'}}

# 키 : 이름과 나이 데이터
persons3={ ('홍길동', 20):{'job':'학생'},
           ('홍마징', 30):{'job':'아빠'},
           ('홍길령', 35):{'job':'엄마'},
           ('홍미련', 15):{'job':'중학생'}
}
print(persons2)
print(persons3)

