#--------------------------------------------------------
# 숫자를 입력 받아서 음이아닌 정수와 음수 구분하기
#--------------------------------------------------------
# n=int(input("숫자만 입력 : "))

# if n>=0:
#     print(f'음이아닌 정수 : {n}')
# else:
#     print(f'음수 : {n}')

# print("-"*60)

#-------------------------------------------------------
# 실습 : 점수를 입력 받아서 합격과 불합격 출력
# 합격 : 60점 이상
jumsu=int(input("점수 숫자만 입력 : "))
if jumsu>=60:
    print("당신은 합격입니다")
else:
    print("당신은 불합격입니다.")




# 점수를 받아서 학점출력
# 학점 : A,B,C,D,E,F
hak=int(input("학점을 입력 숫자만 : "))
if hak>=90:
    print("당신은 A 입니다")
elif hak<90 and hak>=80:
    print("당신은 B 입니다")
elif hak<80 and hak>=70:
    print("당신은 C 입니다")
elif hak<70 and hak>=60:
    print("당신은 D 입니다")
elif hak<60 and hak>=50:
    print("당신은 E 입니다")
else:
    print("당신은 F 입니다.")
    